import re

# Задача № 1
s = input("Введите дату в формате dd-mm-YYYY: ")


def func(a):
    lst = re.findall(r'^([0-2][\d]|3[01])-(0[\d]|1[0-2])-(19[\d][\d]|20[0-2][\d]$)', a)
    if lst:
        print("Вы правильно ввели дату.")
    else:
        print("Вы неправильно ввели дату!")


func(s)

# Задача № 2
s = input("Введите номер телефона: ")


def func(a):
    lst = re.findall(r'^[+]?7\s?\(?[\d]{3}\)?\s?[\d]{3}\-?\s?[\d]{2}\-?\s?[\d]{2}$', a)
    if lst:
        print("Вы правильно ввели номер телефона.")
    else:
        print("Вы неправильно ввели номер телефона!")


func(s)
