# Задача №1
# num = int(input("Введите пятизначное число: "))
# num2 = num
#
# a = num2 % 10
# num2 = num2 // 10
#
# b = num2 % 10
# num2 = num2 // 10
#
# c = num2 % 10
# num2 = num2 // 10
#
# d = num2 % 10
# num2 = num2 // 10
#
# i = num2
# s = i * d * c * b * a
# s2 = (i + d + c + b + a) / 5
# print("Произведение цифр числа " + str(num) + ": " + str(s))
# print("Среднее арифметическое: " + str(s2))

# Задача №2
# num = int(input("Введите целое число: "))
# if num % 2 == 0:
#     print("Число " + str(num) + " - четное")
# if num % 2:
#     print("Число " + str(num) + " - нечетное")

# Задача №3
# print("Выберите операцию:\n1 - \"r\" - применяет унарный минус к операнду\n2 - \"+\" - сложение\n3 - \"-\" - "
#       "вычитание\n4 - \"/\" - деление\n5 - \"*\" - умножение\n6 - \"%\" - деление по модулю (остаток от деления)"
#       "\n7 - \"<\" - минимальное из двух чисел\n8 - \">\" - максимальное из двух чисел")
# num = int(input("Введите цифру: "))
# if num > 8 or num < 1:
#     print("Выбранная вами операция не найдена!")
# if num == 1:
#     p = int(input("Введите число: "))
#     p = -p
#     print("Результат: " + str(p))
# if 2 <= num <= 8:
#     a = int(input("Введите первое число: "))
#     b = int(input("Введите второе число: "))
#     if num == 2:
#         print("Результат:", a + b)
#     if num == 3:
#         print("Результат:", a - b)
#     if num == 4:
#         if b == 0:
#             print("На 0 делить нельзя!")
#         else:
#             print("Результат:", a / b)
#     if num == 5:
#         print("Результат:", a * b)
#     if num == 6:
#         print("Результат:", a % b)
#     if num == 7:
#         if a == b:
#             print("Данные числа равны!")
#         if a < b:
#             print("Результат:", a)
#         if a > b:
#             print("Результат:", b)
#     if num == 8:
#         if a == b:
#             print("Данные числа равны!")
#         if a < b:
#             print("Результат:", b)
#         if a > b:
#             print("Результат:", a)

# # Задача №4
# n = int(input("Введите число от 1 до 99: "))
# if 1 <= n <= 99:
#     if n == 1 or n == 21 or n == 31 or n == 41 or n == 51 or n == 61 or n == 71 or n == 81 or n == 91:
#         print(n, "копейка")
#     if (2 <= n <= 4 or 22 <= n <= 24 or 32 <= n <= 34 or 42 <= n <= 44 or 52 <= n <= 54 or 62 <= n <= 64 or
#             72 <= n <= 74 or 82 <= n <= 84 or 92 <= n <= 94):
#         print(n, "копейки")
#     if (5 <= n <= 20 or 25 <= n <= 30 or 35 <= n <= 40 or 45 <= n <= 50 or 55 <= n <= 60 or 65 <= n <= 70 or
#             75 <= n <= 80 or 85 <= n <= 90 or 95 <= n <= 99):
#         print(n, "копеек")
# else:
#     print("Введите любое число указанное в условии!")
